### Creating Tables with Composite and Foreign Keys

#### Learning Objectives
By the end of this exercise, we will:
- Understand how to define **composite primary keys** (using more than one column as a unique identifier).
- Understand how to create **foreign keys** that reference another table.

#### Overview
We’ll use the existing `Access_to_Basic_Services` table to create two new tables:
1. **Basic_services** — contains access to drinking water and sanitation data for each country and year.  
   - **Composite Key:** (`Country_name`, `Time_period`)
   - **Foreign Key:** `Country_name` references `Geographic_Location(Country_name)`

2. **Economic_indicators** — contains GDP, population, and unemployment data for each country and year.  
   - **Composite Key:** (`Country_name`, `Time_period`)
   - **Foreign Key:** `Country_name` references `Geographic_Location(Country_name)`

We’ll first connect to our MySQL database, then create the tables, and finally populate them with the relevant data extracted from the `Access_to_Basic_Services` table.

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:password@localhost:3306/united_nations

In [3]:
%%sql

SELECT
    *
FROM
    Access_to_Basic_Services
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2015, Decimal('94.67'), Decimal('98.00'), Decimal('17.542806'), Decimal('184.39'), Decimal('2699700.00'), Decimal('4.93')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2016, Decimal('94.67'), Decimal('98.00'), Decimal('17.794055'), Decimal('137.28'), Decimal('2699700.00'), Decimal('4.96')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2017, Decimal('95.00'), Decimal('98.00'), Decimal('18.037776'), Decimal('166.81'), Decimal('2699700.00'), Decimal('4.90')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2018, Decimal('95.00'), Decimal('98.00'), Decimal('18.276452'), Decimal('179.34'), Decimal('2699700.00'), Decimal('4.85')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2019, Decimal('95.00'), Decimal('98.00'), Decimal('18.513673'), Decimal('181.67'), Decimal('2699700.00'), Decimal('4.80'))]

### 1. Creating the `Basic_services` Table

We’ll now create a new table named `Basic_services` that stores data about access to water and sanitation services.

**Structure:**
- `Country_name` → Foreign key referencing `Geographic_Location`
- `Time_period` → Combined with `Country_name` to form the composite primary key
- `Pct_managed_drinking_water_services`
- `Pct_managed_sanitation_services`

In [4]:
%%sql

-- Step 1: Create the Basic_services table
CREATE TABLE Basic_services (
    Country_name VARCHAR(100),
    Time_period INT,
    Pct_managed_drinking_water_services FLOAT,
    Pct_managed_sanitation_services FLOAT,
    PRIMARY KEY (Country_name, Time_period),
    FOREIGN KEY (Country_name) REFERENCES Geographic_Location(Country_name)
);

-- Step 2: Insert data into Basic_services
INSERT INTO Basic_services (Country_name, Time_period, Pct_managed_drinking_water_services, Pct_managed_sanitation_services)
SELECT
    Country_name,
    Time_period,
    Pct_managed_drinking_water_services,
    Pct_managed_sanitation_services
FROM
    Access_to_Basic_Services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
0 rows affected.
1048 rows affected.

[]

### 2. Creating the `Economic_indicators` Table

Next, we’ll create another table named `Economic_indicators` that stores data about GDP, population, and unemployment.

**Structure:**
- `Country_name` → Foreign key referencing `Geographic_Location`
- `Time_period` → Combined with `Country_name` to form the composite primary key
- `Est_gdp_in_billions`
- `Est_population_in_millions`
- `Pct_unemployment`

In [5]:
%%sql

-- Step 1: Create the Economic_indicators table
CREATE TABLE Economic_indicators (
    Country_name VARCHAR(100),
    Time_period INT,
    Est_gdp_in_billions FLOAT,
    Est_population_in_millions FLOAT,
    Pct_unemployment FLOAT,
    PRIMARY KEY (Country_name, Time_period),
    FOREIGN KEY (Country_name) REFERENCES Geographic_Location(Country_name)
);

-- Step 2: Insert data into Economic_indicators
INSERT INTO Economic_indicators (Country_name, Time_period, Est_gdp_in_billions, Est_population_in_millions, Pct_unemployment)
SELECT
    Country_name,
    Time_period,
    Est_gdp_in_billions,
    Est_population_in_millions,
    Pct_unemployment
FROM
    Access_to_Basic_Services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
0 rows affected.
1048 rows affected.

[]

### Verifying the New Tables

We’ll confirm that our new tables have been created successfully and populated with data by displaying a few records from each.

In [7]:
%%sql
SELECT * FROM Basic_services LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('Afghanistan', 2015, 67.0, 45.67),
 ('Afghanistan', 2016, 69.67, 47.0),
 ('Afghanistan', 2017, 72.33, 49.33),
 ('Afghanistan', 2018, 75.33, 50.67),
 ('Afghanistan', 2019, 78.0, 52.33)]

In [8]:
%%sql
SELECT * FROM Economic_indicators LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('Afghanistan', 2015, 20.0, 33.7535, None),
 ('Afghanistan', 2016, 18.02, 34.6362, None),
 ('Afghanistan', 2017, 18.9, 35.6434, 11.18),
 ('Afghanistan', 2018, 18.42, 36.6868, None),
 ('Afghanistan', 2019, 18.9, 37.7695, None)]